nxp-mcuxpresso/mcuxsdk-examples/_boards/mimxrt700evk/vglite_examples/vector_freertos/cm33_core1/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitUARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitUARTPins(void)
{

    const uint32_t port0_pin31_config = (/* Pin is configured as LP_FLEXCOMM0_P0 */
                                         IOPCTL_PIO_FUNC1 |
                                         /* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_DI |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Disable input buffer function */
                                         IOPCTL_PIO_INBUF_DI |
                                         /* Normal mode */
                                         IOPCTL_PIO_SLEW_RATE_NORMAL |
                                         /* Normal drive */
                                         IOPCTL_PIO_FULLDRIVE_DI |
                                         /* Analog mux is disabled */
                                         IOPCTL_PIO_ANAMUX_DI |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI);
    /* PORT0 PIN31 (coords: N4) is configured as LP_FLEXCOMM0_P0 */
    IOPCTL_PinMuxSet(0U, 31U, port0_pin31_config);

    const uint32_t port1_pin0_config = (/* Pin is configured as LP_FLEXCOMM0_P1 */
                                        IOPCTL_PIO_FUNC1 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Disable input buffer function */
                                        IOPCTL_PIO_INBUF_DI |
                                        /* Normal mode */
                                        IOPCTL_PIO_SLEW_RATE_NORMAL |
                                        /* Normal drive */
                                        IOPCTL_PIO_FULLDRIVE_DI |
                                        /* Analog mux is disabled */
                                        IOPCTL_PIO_ANAMUX_DI |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI);
    /* PORT1 PIN0 (coords: N5) is configured as LP_FLEXCOMM0_P1 */
    IOPCTL_PinMuxSet(1U, 0U, port1_pin0_config);

    /* P0_14 VDD2_CLKOUT - J507 */
    const uint32_t port0_pin14_config = (/* Pin is configured as CLKOUT */
                                         IOPCTL_PIO_FUNC6 |
    									/* Disable pull-up / pull-down function */
    									IOPCTL_PIO_PUPD_DI |
    									/* Enable pull-down function */
    									IOPCTL_PIO_PULLDOWN_EN |
    									/* Enables input buffer function */
    									IOPCTL_PIO_INBUF_DI |
    									/* Normal mode */
    									IOPCTL_PIO_SLEW_RATE_NORMAL |
    									/* Normal drive */
    									IOPCTL_PIO_DRIVE_100OHM |
    									/* Analog mux is disabled */
    									IOPCTL_PIO_ANAMUX_DI |
    									/* Pseudo Output Drain is disabled */
    									IOPCTL_PIO_PSEDRAIN_DI |
    									/* Input function is not inverted */
    									IOPCTL_PIO_INV_DI);
    IOPCTL_PinMuxSet(0U, 14U, port0_pin14_config);	  

}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
